tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask" 

# Homebrew cask formulae for Logitech Options
tap "homebrew/cask-drivers"

tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# SSH
brew "github-keygen"
brew "gnupg"
brew "openssl"
brew "httpd"

# Keyboard/Mouse
cask "karabiner-elements"
cask "logi-options-plus"
cask "logitech-options"

brew "mas"
brew "gh"
cask "carbon-copy-cloner"
cask "amethyst"
cask "1password"
cask "1password-cli"

# Swift related tools
# brew "carthage"
brew "cocoapods"

# General Dev Tools
cask "kitty"
brew "git"
cask "github"
brew "bfg" # Cleaning the git history
brew "lazygit"
brew "shellcheck"
brew "jq"
brew "radare2" # reverse engineering
cask "devutils"
cask "thor"
cask "charles"
cask "postman"
#brew "newman" # postman test runner
# cask "docker" 
brew "tmux"
brew "stow"
cask "syntax-highlight"

# Programming Languages
brew "pyenv"
brew "pipenv"
brew "rbenv"
# brew "rust"
brew "cargo-nextest"
brew "rustup-init"
brew "rust-analyzer"
brew "golang"
brew "wabt" # webassembly toold
brew "wasmer"
brew "llvm"

# Language Servers
brew "lua-language-server"

# Programming Language Tools
brew "luarocks"

# Linters
brew "proselint"
brew "gitlint"
brew "stylua"

# Frameworks
brew "nodenv"
brew "nodenv/nodenv/nodenv-default-packages"

# Browsers
cask "firefox"
cask "google-chrome"

# Command Line Utils
brew "ImageMagick"
brew "fzf"
brew "bat"
brew "zoxide"
brew "bandwhich"
brew "tokei"
brew "dust"
brew "exa"
brew "diff-so-fancy"
brew "ripgrep"
brew "fd"
brew "tldr"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "ispell"

# Editors
brew "nvim"
brew "emacs"
# cask "emacs"

# Email
brew "offlineimap"
brew "mu"

#Fonts
cask "sf-symbols"

# Themes
brew "romkatv/powerlevel10k/powerlevel10k"

# App Store Apps
mas "Xcode", id: 497799835
cask "xcodes"
cask "microsoft-remote-desktop"
mas "WireGuard", id: 1451685025
mas "Speedtest by Ookla", id: 1153157709

