tap "homebrew/bundle"
tap "a7ex/homebrew-formulae" # for xcresultparser
tap "noahgorstein/tap"
tap "arl/arl"
tap "nikitabobko/tap/aerospace"
tap "buo/cask-upgrade"

# Exceed
tap "centrifugal/centrifugo"
brew "centrifugo"
brew "redis"
brew "postgresql@14"
brew "imagemagick"
brew "opensearch"
brew "memcached"
brew "cmake"
brew "yarn"

# SSH
brew "github-keygen"
brew "gnupg"
brew "openssl"
brew "httpd"

# Keyboard/Mouse
cask "karabiner-elements"
cask "logi-options-plus"
cask "logitech-options"

brew "mas" # Mac App Store command-line interface
brew "gh"
cask "carbon-copy-cloner"
cask "1password"
brew "pass"
brew "go-jira"

# Swift related tools
brew "cocoapods"
brew "swiftformat"
brew "swiftlint"
cask "peripheryapp/periphery/periphery"
brew "swiftgen"
brew "xcbeautify"
brew "xcresultparser"

# SSH
brew "awscli"

# General Dev Tools
cask "alacritty" # terminal
cask "wezterm" # terminal
cask "nikitabobko/tap/aerospace@0.12.0"
cask "kitty" # terminal
cask "warp" # terminal
brew "starship" # shell prompt
brew "git"
brew "git-lfs" # Git extension for versioning large files
brew "pre-commit" # run scripts before git commiting
brew "bfg" # tool for cleaning up git repos
cask "github"
brew "lazygit"
brew "ranger" # file manager
brew "lf" # file manager
brew "yazi" 
  brew "ffmpegthumbnailer"
  brew "unar"
  brew "poppler"
  brew "sevenzip"
  brew "font-symbols-only-nerd-font"

brew "entr" # Run arbitrary commands when files change

brew "git-delta"
brew "shellcheck"
brew "jq"
brew "yq"
brew "jqp"
brew "cmake"
brew "radare2" # reverse engineering
cask "devutils"
cask "thor"
cask "charles"
cask "postman"
#brew "newman" # postman test runner

tap "tufin/homebrew-tufin" # openapi diff
brew "oasdiff" # openapi diff

cask "docker" 
brew "act" # Run your GitHub Actions locally
brew "tmux" # terminal multiplexer
brew "gitmux" # git info in the tmux status bar
brew "stow" # Install files from .dotfiles
cask "syntax-highlight" # Quicklook extension for source files
brew "zoxide"

# Programming Languages

cask "miniconda"
brew "rbenv"
# Node
brew "mise" # version manager for nvm, nodenv, pyenv, etc.
brew "pnpm"

# brew "rust"
# brew "cargo-nextest" # don't install this because it installs rust
brew "rustup-init"
brew "rust-analyzer"
brew "sccache" # cache for rust builds
brew "golang"
brew "wabt" # webassembly toold
brew "wasmer"
brew "llvm"
brew "r"
cask "rstudio"
brew "gdal" # required to the DOC R Work
brew "udunits" # required to the DOC R Work
brew "fribidi" # required to the DOC R Work
# cask "jupyterlab"
# brew "jupyterlab"
brew "php"
brew "openjdk@17"
brew "groovy"
cask "android-sdk"

# Databases
brew "sqlite"

# Language Servers
brew "lua-language-server"

# Programming Language Tools
brew "luarocks"

# Linters
brew "proselint"
brew "gitlint"
brew "stylua"

# Frameworks
brew "nodenv"
brew "nodenv/nodenv/nodenv-default-packages"

# Browsers
cask "firefox"
cask "google-chrome"
cask "tor-browser"
brew "lynx"

# Command Line Utils
brew "ImageMagick"
brew "exiftool"
brew "fzf"
brew "bat"
brew "zoxide" # use z or ze instead of cd
brew "tokei" # Program that allows you to count code, quickly
brew "dust" # du + rust = dust. Like du but more intuitive. Displays how much space each directory is using.
brew "eza" # Modern replacement for 'ls'
brew "diff-so-fancy"
brew "ripgrep"
brew "htop"
brew "fd" # User-friendly alternative to find
brew "tldr"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"
brew "bash"
brew "ispell"
brew "tree"
brew "parallel"
brew "glow"
brew "firebase-cli"

# Mobile Security Tools
brew "libimobiledevice"

tap "cutzenfriend/homebrew-cmdg"
brew "cmdg" # gmail client

# Editors
brew "nvim"

#Fonts
cask "sf-symbols"

# Mac
cask "qlcolorcode"

# App Store Apps
mas "Xcode", id: 497799835
cask "copilot-for-xcode"
mas "InjectionIII", id: 1380446739 # code injection for live updates
cask "swiftformat-for-xcode"
# mas "WireGuard", id: 1451685025
mas "Speedtest by Ookla", id: 1153157709
cask "vlc"
brew "youtube-dl"
cask "obsidian"
cask "geekbench"
cask "numi"
