tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask" 
tap "a7ex/homebrew-formulae" # for xcresultparser
tap "noahgorstein/tap"
tap "arl/arl"

tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# SSH
brew "github-keygen"
brew "gnupg"
brew "openssl"
brew "httpd"

# Keyboard/Mouse
cask "karabiner-elements"
cask "logi-options-plus"
cask "logitech-options"

brew "mas" # Mac App Store command-line interface
brew "gh"
cask "carbon-copy-cloner"
cask "1password"
cask "1password-cli"
brew "go-jira"

# Swift related tools
brew "cocoapods"
brew "swiftformat"
brew "swiftgen"
brew "xcbeautify"
brew "xcresultparser"

# General Dev Tools
cask "alacritty" # terminal
cask "wezterm" # terminal
cask "kitty" # terminal
cask "warp" # terminal
brew "nushell" # shell
brew "starship" # shell prompt
brew "git"
brew "bfg" # tool for cleaning up git repos
cask "github"
brew "lazygit"
brew "ranger" # file manager
brew "lf" # file manager
brew "yazi" 
  brew "ffmpegthumbnailer"
  brew "unar"
  brew "poppler"

brew "git-delta"
brew "shellcheck"
brew "jq"
brew "jqp"
brew "cmake"
brew "radare2" # reverse engineering
cask "devutils"
cask "thor"
cask "charles"
cask "postman"
#brew "newman" # postman test runner
cask "docker" 
brew "act" # Run your GitHub Actions locally
brew "tmux" # terminal multiplexer
brew "gitmux" # git info in the tmux status bar
brew "zellij" # terminal multiplexer
brew "stow" # Install files from .dotfiles
cask "syntax-highlight" # Quicklook extension for source files
brew "zoxide"

# Programming Languages
brew "pyenv"
brew "pipenv"
brew "rbenv"
brew "rtx" # version manager for nvm, nodenv, pyenv, etc.
# brew "rust"
# brew "cargo-nextest" # don't install this because it installs rust
brew "rustup-init"
brew "rust-analyzer"
brew "sccache" # cache for rust builds
brew "golang"
brew "wabt" # webassembly toold
brew "wasmer"
brew "llvm"
brew "r"
cask "rstudio"
brew "gdal" # required to the DOC R Work
brew "udunits" # required to the DOC R Work
brew "fribidi" # required to the DOC R Work
brew "php"

# Databases
brew "sqlite"

# Language Servers
brew "lua-language-server"

# Programming Language Tools
brew "luarocks"

# Linters
brew "proselint"
brew "gitlint"
brew "stylua"

# Frameworks
brew "nodenv"
brew "nodenv/nodenv/nodenv-default-packages"

# Browsers
cask "firefox"
cask "google-chrome"
cask "tor-browser"

# Command Line Utils
brew "ImageMagick"
brew "exiftool"
brew "fzf"
brew "bat"
brew "zoxide" # use z or ze instead of cd
brew "tokei" # Program that allows you to count code, quickly
brew "dust" # du + rust = dust. Like du but more intuitive. Displays how much space each directory is using.
brew "exa" # Modern replacement for 'ls'
brew "diff-so-fancy"
brew "ripgrep"
brew "htop"
brew "fd" # User-friendly alternative to find
brew "tldr"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "bash"
brew "ispell"
brew "tree"

# Editors
brew "nvim"

#Fonts
cask "sf-symbols"

# App Store Apps
mas "Xcode", id: 497799835
cask "swiftformat-for-xcode"
mas "WireGuard", id: 1451685025
mas "Speedtest by Ookla", id: 1153157709
cask "vlc"
brew "youtube-dl"
cask "obsidian"

